const TelegramBot = require('node-telegram-bot-api');
const Storage = require('node-storage');
var store = new Storage('data.json');
const token = '615978354:AAHY5rmo8w2vnDkInzxKKzNRv_jfwfLiI0c';
var data = [];

const bot = new TelegramBot(token, {polling: true});

var response = {
    hello: '╔═══════════════════╗\n║     Вас вітає Telegram-бот:     ║\n║       @timetableKSPU_bot       ║\n╠═══════════════════╣\n║    Чим можу допомогти?     ║\n╚═══════════════════╝',
  }

var keyboards = {
    
    mainmenu: {
        "reply_markup": {"keyboard": [["📄 Поточна пара"], ["📅 Розклад занять"],["⏰ Розклад дзвінків"],["🆎 Тип тижня"],["⚙ Налаштування"]], resize_keyboard: true}
    },
    course: {
        "reply_markup": {"keyboard": [["1","2","3","4"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    groups1: {
        "reply_markup": {"keyboard": [["111", "121", "131", "132", "141", "151"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    groups2: {
       "reply_markup": {"keyboard": [["211","221","231","241","251"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    groups3: {
        "reply_markup": {"keyboard": [["311","321","331", "341", "351"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    groups4: {
        "reply_markup": {"keyboard": [["411","421","431", "441"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    courseSettings: {
        "reply_markup": {"keyboard": [["№1","№2","№3","№4"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    groups1Settings: {
        "reply_markup": {"keyboard": [["№111", "№121", "№131", "№132", "№141", "№151"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    groups2Settings: {
       "reply_markup": {"keyboard": [["№211","№221","№231", "№241", "№251"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    groups3Settings: {
        "reply_markup": {"keyboard": [["№311","№321","№331", "№341", "№351"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    groups4Settings: {
        "reply_markup": {"keyboard": [["№411","№421","№431", "№441"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    timeBackMenu: {
        "reply_markup":{"keyboard": ["⬅️ Головне меню"]}
    },
    typeweek: {
        "reply_markup": {"keyboard": [["А","Б"], ["⬅️ Головне меню"]], resize_keyboard: true}
    },
    settings: {
        "reply_markup": {"keyboard": [["👥 Курс та група"], ["⬅️ Головне меню"]], resize_keyboard: true}
    }
}

var varBell = {
    abell: '[I]   пара: 8:30 - 9:50 \n[II]  пара: 10:10 - 11:30 \n[III] пара: 11:50 - 13:10 \n[IV] пара: 13:40 - 15:00 \n[V]  пара: 15:10 - 16:30 \n[VI] пара: 16:40 - 18:00'
}

var savecourse;
var savegroup;

function saveGroup(id , group) {
    store.put(id+'.group', group);
}

function getUser(id)
{
    return store.get(String(id));
}

// Выбор Расписание (1-4)
bot.onText(/111|121|131|132|141|151/, function (msg) {
    var fromId = msg.from.id;
    switch (msg.text)
    {
        case "111":
            savegroup = 0;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "121":
            savegroup = 1;
            bot .sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "131":
            savegroup = 2;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "132":
            savegroup = 3;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "141":
            savegroup = 4;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "151":
            savegroup = 5;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;    
    }
});

bot.onText(/211|221|231|241|251/, function (msg) {
    var fromId = msg.from.id;
    switch (msg.text)
    {
        case "211":
            savegroup = 0;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "221":
            savegroup = 1;
            bot .sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "231":
            savegroup = 2;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "241":
            savegroup = 3;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "251":
            savegroup = 4;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;        
    }
});

bot.onText(/311|321|331|341|351/, function (msg) {
    var fromId = msg.from.id;
    switch (msg.text)
    {
        case "311":
            savegroup = 0;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "321":
            savegroup = 1;
            bot .sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "331":
            savegroup = 2;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "341":
            savegroup = 3;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "351":
            savegroup = 4;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;        
    }
});

bot.onText(/411|421|431|441/, function (msg) {
    var fromId = msg.from.id;
    switch (msg.text)
    {
        case "411":
            savegroup = 0;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "421":
            savegroup = 1;
            bot .sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "431":
            savegroup = 2;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;
        case "441":
            savegroup = 3;
            bot.sendMessage(msg.chat.id, "Виберіть тиждень", keyboards.typeweek);
            break;        
    }
});

// Выбор курса (1-4)
bot.onText(/[1-4]/, function (msg) {
    var fromId = msg.from.id;
    switch (msg.text)
    {
        case "1":
            savecourse = 0;
            bot.sendMessage(msg.chat.id, "Виберіть свою групу",keyboards.groups1);
            break;
        case "2":
            savecourse = 1;
            bot .sendMessage(msg.chat.id, "Виберіть свою групу",keyboards.groups2);
            break;
        case "3":
            savecourse = 2;
            bot.sendMessage(msg.chat.id, "Виберіть свою групу",keyboards.groups3);
            break;
        case "4":
            savecourse = 3;
            bot.sendMessage(msg.chat.id, "Виберіть свою групу",keyboards.groups4);
            break;
    }
});

bot.onText(/№111|№121|№131|№132|№141|№151/, function (msg) {
    var fromId = msg.from.id;
    msg.text = msg.text.substring(1, msg.text.length);
    switch (msg.text)
    {
        case "111":
            savegroup = 0;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "121":
            savegroup = 1;
            bot .sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "131":
            savegroup = 2;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "132":
            savegroup = 3;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "141":
            savegroup = 4;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "151":
            savegroup = 5;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;    
    }
    saveGroup(msg.from.id, savegroup);
});

bot.onText(/№211|№221|№231|№241|№251/, function (msg) {
    var fromId = msg.from.id;
    msg.text = msg.text.substring(1, msg.text.length);
    switch (msg.text)
    {
        case "211":
            savegroup = 0;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "221":
            savegroup = 1;
            bot .sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "231":
            savegroup = 2;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "241":
            savegroup = 3;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "251":
            savegroup = 4;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;        
    }
    saveGroup(msg.from.id, savegroup);
});

bot.onText(/№311|№321|№331|№341|№351/, function (msg) {
    var fromId = msg.from.id;
    msg.text = msg.text.substring(1, msg.text.length);
    switch (msg.text)
    {
        case "311":
            savegroup = 0;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "321":
            savegroup = 1;
            bot .sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "331":
            savegroup = 2;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "341":
            savegroup = 3;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "351":
            savegroup = 4;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;        
    }
    saveGroup(msg.from.id, savegroup);
});

bot.onText(/№411|№421|№431|№441/, function (msg) {
    var fromId = msg.from.id;
    msg.text = msg.text.substring(1, msg.text.length);
    switch (msg.text)
    {
        case "411":
            savegroup = 0;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "421":
            savegroup = 1;
            bot .sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "431":
            savegroup = 2;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;
        case "441":
            savegroup = 3;
            bot.sendMessage(msg.chat.id, "Дані збережені 🤗");
            break;        
    }
    saveGroup(msg.from.id, savegroup);
});

// Выбор курса (1-4)
bot.onText(/№1|№2|№3|№4/, function (msg) {
    var fromId = msg.from.id;
    msg.text = msg.text.substring(1, msg.text.length);
    
    switch (msg.text)
    {
        case "1":
            savecourse = 0;
            bot.sendMessage(msg.chat.id, "Виберіть свою групу",keyboards.groups1Settings);
            break;
        case "2":
            savecourse = 1;
            bot .sendMessage(msg.chat.id, "Виберіть свою групу",keyboards.groups2Settings);
            break;
        case "3":
            savecourse = 2;
            bot.sendMessage(msg.chat.id, "Виберіть свою групу",keyboards.groups3Settings);
            break;
        case "4":
            savecourse = 3;
            bot.sendMessage(msg.chat.id, "Виберіть свою групу",keyboards.groups4Settings);
            break;
    }
    id = String(msg.from.id); 
    store.put(id, {course: savecourse});
});

// старт
bot.onText(/\/start/, function (msg) {
    var fromId = msg.from.id;
    bot.sendMessage(msg.chat.id,response.hello, keyboards.mainmenu);
});

// текущая пара
bot.onText(/Поточна пара/, function (msg) {
    var fromId = msg.from.id;
    var mydate = new Date();
    if (Nowlesson() == 0 || Nowlesson() == 1 || Nowlesson() == 2 || Nowlesson() == 3 || Nowlesson() == 4 || Nowlesson() == 5)
    {
        bot.sendMessage(msg.chat.id, CycleNowLesson(Groups,getUser(fromId).course,getUser(fromId).group,TypeWeek(),TypeDay(),Nowlesson()));
    }
    else if (Nowlesson() == 11)
    {
        bot.sendMessage(msg.chat.id, "Пари закінчилися");
    }
    else{
        bot.sendMessage(msg.chat.id, Turn[Nowlesson()-6]);
        bot.sendMessage(msg.chat.id, "Наступна пара: " + CycleNowLesson(Groups,getUser(fromId).course,getUser(fromId).group,TypeWeek(),TypeDay(),Nowlesson()-5));
    }
});

// Расписание звонков
bot.onText(/Розклад дзвінків/, function (msg) {
    var fromId = msg.from.id;
    bot.sendMessage(msg.chat.id, varBell.abell);
});


// Выбор mainmenu (Текущая пара / Расписание)
bot.onText(/Розклад занять/, function (msg) {
    var fromId = msg.from.id;
    bot.sendMessage(msg.chat.id, "Виберіть свій курс",keyboards.course);
});

// Курс та група
bot.onText(/Налаштування/, function (msg) {
    var fromId = msg.from.id;
    bot.sendMessage(msg.chat.id, "Меню налаштування",keyboards.settings);
});

// Курс та група
bot.onText(/Курс та група/, function (msg) {
    var fromId = msg.from.id;
    bot.sendMessage(msg.chat.id, "Виберіть свій курс та групу",keyboards.courseSettings);
});

bot.onText(/Тип тижня/, function (msg) {
    var fromId = msg.from.id;
    if (TypeWeek() == 0)
    {
        y = "Зараз тиждень - [А]"
    }
    else
    {
        y = "Зараз тиждень - [Б]"
    }
    bot.sendMessage(msg.chat.id, y);
});

bot.onText(/А|Б/, function (msg) {
    var fromId = msg.from.id;
    switch (msg.text)
    {
    case "А":
        bot.sendMessage(msg.chat.id, CycleTimeTable(Groups[savecourse][savegroup],0));        
        break;
    case "Б":
        bot.sendMessage(msg.chat.id, CycleTimeTable(Groups[savecourse][savegroup],1));
        break;
    }
});

Date.prototype.getWeek = function() 
{
    var date = new Date(this.getTime());
     date.setHours(0, 0, 0, 0);
    date.setDate(date.getDate() + 3 - (date.getDay() + 6) % 7);
    var week1 = new Date(date.getFullYear(), 0, 4);
    return 1 + Math.round(((date.getTime() - week1.getTime()) / 86400000 - 3 + (week1.getDay() + 6) % 7) / 7);
}

var dayweek = ["[ Понеділок ]", "[ Вівторок ]","[ Середа ]","[ Четверг ]","[ П'ятниця ]"]

function TypeWeek()
{
    var mydate = new Date();
    var x = mydate.getWeek();
    var y;
    if (x % 2 == 1)
    {
        y = 0;
    }
    else
    {
        y = 1;
    }
    return y;
}

function CycleTimeTable(massiv,tw)
{
    var text = "";
    for (var i = 0; i <= 4; i++)
    {
        text += dayweek[i] + ":\n\n"
        for (var q = 0; q <= 5; q++)
        {
            text+=(q+1) + ". " + massiv[tw][i][q] + "\n";
        }
        text += "\n";
    }
    return text;
}

function CycleNowLesson(massiv,crs,grp,tw,tpd,tmlssn)
{
    var text = massiv[crs][grp][tw][tpd][tmlssn];
    return text;
}

function TypeDay()
{
    var mydate = new Date();
    var td = mydate.getDay();
    if (td == 0)
    {
        td = 7;
    }
    return td-1;
}

function Nowlesson()
{
    var mydate = new Date();
    var savelesson;
    var h = mydate.getHours();
    var m = mydate.getMinutes();
    if ((h == 8 && m >= 30) || (h == 9 && m < 50))
    {
        savelesson = 0;
    }
    else if ((h == 9 && m >= 50) || (h == 10 && m < 10))
    {
        savelesson = 6;
    }
    else if ((h == 10 && m >= 10) || (h == 11 && m < 30))
    {
        savelesson = 1;
    }
    else if ((h == 11 && m >= 30) || (h == 10 && m < 50))
    {
        savelesson = 7;
    }
    else if ((h == 11 && m >= 50) || (h == 12) || (h == 13 && m < 10)) 
    {
        savelesson = 2;
    }
    else if ((h == 13 && m >= 10) || (h == 13 && m < 40))
    {
        savelesson = 8;
    }
    else if ((h == 13 && m >= 40) || (h == 14))
    {
        savelesson = 3;
    }
    else if (h == 15 && m < 10)
    {
        savelesson = 9;
    }
    else if ((h == 15 && m >= 10) || (h == 16 && m < 30))
    {
        savelesson = 4;
    }
    else if ((h == 16 && m >= 30) || (h == 16 && m < 40))
    {
        savelesson = 10;
    }
    else if ((h == 16 && m >= 40) || (h == 17))
    {
        savelesson = 5;
    }
    else{
        savelesson = 11;
    }
    return savelesson;
}

// Главное меню
bot.onText(/Головне меню/, function (msg, day) {
    var fromId = msg.from.id;
    bot.sendMessage(msg.chat.id,"Головне меню", keyboards.mainmenu);
});

// Сохраняем пользователя
const addToJson = function(id,user) {
  store.put('users.'+String(id), user);
  console.log("SaveUser");
}

// Вызываем всех пользователей
const getUsers = function(){
  return(store.get('users'));
  console.log("GetUsers");
}

//1

var A111 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A121 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A131 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A132 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A141 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A151 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

//2 


var A211 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A221 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A231 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A241 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A251 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

// 3

var A311 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A321 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A331 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A341 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A351 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A411 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A421 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A431 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var A441 = [
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ],
    [
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"],
        ["Математичний аналіз","Українська мова","Теорія ймовірності", "Основи програмування","Пари закінчились","Пари закінчились"]
    ]
];

var Groups = [
    [A111, A121, A131 ,A132, A141, A151],
    [A211, A221, A231, A241, A251],
    [A311, A321, A331, A341, A351],
    [A411, A421, A431, A441],
]

var Turn = ["Перерва №1","Перерва №2","Перерва №3","Перерва №4","Перерва №5"]